In [11]:
pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.14/site-packages (3.0.0)
Requirement already satisfied: numpy>=2.3.3 in ./.venv/lib/python3.14/site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.14/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.14/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
# File format -> stand way of collectiong & Storing data
# Rows -> records
# columns -> variables
# pandas -> open source library for working with data for data manipulation & data analysis

In [12]:
import pandas as pd

In [21]:
data = pd.DataFrame({
    'Students' : ['Raj','Arun','Riya','Priya'],
    'Subjects' : ['Python','Html','Java','React'],
    'Marks' : [85,78,91,97]
})
# df = pd.DataFrame(data,index=['one','two','three','xyz'])
data2 = pd.DataFrame({
    'Students':['ashok','shyamu','bhojraj','krishna bhaiya','govarthan'],
    'subject': ['Python','HTML','JS','JAVA','Pandas'],
    'marks':[12,12,90,100,1]
})

pd.concat([data,data2])

         Students Subjects  Marks subject  marks
0             Raj   Python   85.0     NaN    NaN
1            Arun     Html   78.0     NaN    NaN
2            Riya     Java   91.0     NaN    NaN
3           Priya    React   97.0     NaN    NaN
0           ashok      NaN    NaN  Python   12.0
1          shyamu      NaN    NaN    HTML   12.0
2         bhojraj      NaN    NaN      JS   90.0
3  krishna bhaiya      NaN    NaN    JAVA  100.0
4       govarthan      NaN    NaN  Pandas    1.0

In [37]:
df1 = pd.DataFrame({
    'Students':['Raj','Abhishek','Debashish','Sanket'],
    'Marks':[72,88,2,33]
})
df2 = pd.DataFrame({
    'Name':['Kalash','Jacob','king','Jack'],
    'Ranks':[99,44,56,78]
})
result = df1.join(df2)
df3 = pd.DataFrame({
    'students':[101,102,103,104],
    'City':['Delhi','Pune','Blr','Hyd']
})
result1 = df1.join(df3)
print(result1)

    Students  Marks  students   City
0        Raj     72       101  Delhi
1   Abhishek     88       102   Pune
2  Debashish      2       103    Blr
3     Sanket     33       104    Hyd

In [38]:
data =[101,102,103,104]
pd.Series(data)

0    101
1    102
2    103
3    104
dtype: int64

In [49]:
S = pd.Series(data,index=['Aman','Raj','Submit','Aksa'])
S['Aman']

np.int64(101)

In [52]:
df1.isna()

   Students  Marks
0     False  False
1     False  False
2     False  False
3     False  False